# coding: utf-8

# Python. Быстрый старт.
# Занятие 1.

# Домашнее задание: установить интерпретатор;
#    выполнить действия в интерпретаторе;
#    дописать скрипт, чтобы он перед приветствием выводил название программы


# Строка, начинающаяся с решётки #  - это комментарий, т.е. не выполняется
import os
# Функция print выводит сообщение в командной строке
print("Great Python Program!")
print("Привет, программист!")
print(os.path)

# Функция input запрашивает ввод данных у пользователя
input()
